Revit 2027 API
Document.GetElement(ElementId) Method
 Gets the Element referenced by the input ElementId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element GetElement(
	ElementId id
)
Public Function GetElement (
	id As ElementId
) As Element
public:
Element^ GetElement(
	ElementId^ id
)
member GetElement :
        id : ElementId -> Element
Parameters
id ElementId
 The ElementId, whose referenced Element will be retrieved from the model.
Return Value
Element
 The element referenced by the input argument.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
null will be returned if the input ElementId doesn't reference to a valid Element.
See Also
Reference
Document Class
GetElement Overload
Autodesk.Revit.DB Namespace